GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
extern volatile PORTAbits_t PORTAbits __at(0x150);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0x151);
#ifndef _LIB_BUILD
asm("PORTB equ 0151h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0x151);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80

// Register: PORTC
#define PORTC PORTC
extern volatile unsigned char           PORTC               __at(0x152);
#ifndef _LIB_BUILD
asm("PORTC equ 0152h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
} PORTCbits_t;
extern volatile PORTCbits_t PORTCbits __at(0x152);
// bitfield macros
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC3_POSN                                     0x3
#define _PORTC_RC3_POSITION                                 0x3
#define _PORTC_RC3_SIZE                                     0x1
#define _PORTC_RC3_LENGTH                                   0x1
#define _PORTC_RC3_MASK                                     0x8
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_RC6_POSN                                     0x6
#define _PORTC_RC6_POSITION                                 0x6
#define _PORTC_RC6_SIZE                                     0x1
#define _PORTC_RC6_LENGTH                                   0x1
#define _PORTC_RC6_MASK                                     0x40
#define _PORTC_RC7_POSN                                     0x7
#define _PORTC_RC7_POSITION                                 0x7
#define _PORTC_RC7_SIZE                                     0x1
#define _PORTC_RC7_LENGTH                                   0x1
#define _PORTC_RC7_MASK                                     0x80

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0x154);
#ifndef _LIB_BUILD
asm("PORTE equ 0154h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned RE3                    :1;
    };
} PORTEbits_t;
extern volatile PORTEbits_t PORTEbits __at(0x154);
// bitfield macros
#define _PORTE_RE3_POSN                                     0x3
#define _PORTE_RE3_POSITION                                 0x3
#define _PORTE_RE3_SIZE                                     0x1
#define _PORTE_RE3_LENGTH                                   0x1
#define _PORTE_RE3_MASK                                     0x8

// Register: APMCON
#define APMCON APMCON
extern volatile unsigned char           APMCON              __at(0x1C0);
#ifndef _LIB_BUILD
asm("APMCON equ 01C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :7;
        unsigned APMEN                  :1;
    };
} APMCONbits_t;
extern volatile APMCONbits_t APMCONbits __at(0x1C0);
// bitfield macros
#define _APMCON_EN_POSN                                     0x7
#define _APMCON_EN_POSITION                                 0x7
#define _APMCON_EN_SIZE                                     0x1
#define _APMCON_EN_LENGTH                                   0x1
#define _APMCON_EN_MASK                                     0x80
#define _APMCON_APMEN_POSN                                  0x7
#define _APMCON_APMEN_POSITION                              0x7
#define _APMCON_APMEN_SIZE                                  0x1
#define _APMCON_APMEN_LENGTH                                0x1
#define _APMCON_APMEN_MASK                                  0x80

// Register: APMPRE
#define APMPRE APMPRE
extern volatile unsigned short          APMPRE              __at(0x1C1);
#ifndef _LIB_BUILD
asm("APMPRE equ 01C1h");
#endif

// Register: APMPREL
#define APMPREL APMPREL
extern volatile unsigned char           APMPREL             __at(0x1C1);
#ifndef _LIB_BUILD
asm("APMPREL equ 01C1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRE                    :8;
    };
    struct {
        unsigned PRE0                   :1;
        unsigned PRE1                   :1;
        unsigned PRE2                   :1;
        unsigned PRE3                   :1;
        unsigned PRE4                   :1;
        unsigned PRE5                   :1;
        unsigned PRE6                   :1;
        unsigned PRE7                   :1;
    };
    struct {
        unsigned APMPRE                 :8;
    };
    struct {
        unsigned APMPRE0                :1;
        unsigned APMPRE1                :1;
        unsigned APMPRE2                :1;
        unsigned APMPRE3                :1;
        unsigned APMPRE4                :1;
        unsigned APMPRE5                :1;
        unsigned APMPRE6                :1;
        unsigned APMPRE7                :1;
    };
} APMPRELbits_t;
extern volatile APMPRELbits_t APMPRELbits __at(0x1C1);
// bitfield macros
#define _APMPREL_PRE_POSN                                   0x0
#define _APMPREL_PRE_POSITION                               0x0
#define _APMPREL_PRE_SIZE                                   0x8
#define _APMPREL_PRE_LENGTH                                 0x8
#define _APMPREL_PRE_MASK                                   0xFF
#define _APMPREL_PRE0_POSN                                  0x0
#define _APMPREL_PRE0_POSITION                              0x0
#define _APMPREL_PRE0_SIZE                                  0x1
#define _APMPREL_PRE0_LENGTH                                0x1
#define _APMPREL_PRE0_MASK                                  0x1
#define _APMPREL_PRE1_POSN                                  0x1
#define _APMPREL_PRE1_POSITION                              0x1
#define _APMPREL_PRE1_SIZE                                  0x1
#define _APMPREL_PRE1_LENGTH                                0x1
#define _APMPREL_PRE1_MASK                                  0x2
#define _APMPREL_PRE2_POSN                                  0x2
#define _APMPREL_PRE2_POSITION                              0x2
#define _APMPREL_PRE2_SIZE                                  0x1
#define _APMPREL_PRE2_LENGTH                                0x1
#define _APMPREL_PRE2_MASK                                  0x4
#define _APMPREL_PRE3_POSN                                  0x3
#define _APMPREL_PRE3_POSITION                              0x3
#define _APMPREL_PRE3_SIZE                                  0x1
#define _APMPREL_PRE3_LENGTH                                0x1
#define _APMPREL_PRE3_MASK                                  0x8
#define _APMPREL_PRE4_POSN                                  0x4
#define _APMPREL_PRE4_POSITION                              0x4
#define _APMPREL_PRE4_SIZE                                  0x1
#define _APMPREL_PRE4_LENGTH                                0x1
#define _APMPREL_PRE4_MASK                                  0x10
#define _APMPREL_PRE5_POSN                                  0x5
#define _APMPREL_PRE5_POSITION                              0x5
#define _APMPREL_PRE5_SIZE                                  0x1
#define _APMPREL_PRE5_LENGTH                                0x1
#define _APMPREL_PRE5_MASK                                  0x20
#define _APMPREL_PRE6_POSN                                  0x6
#define _APMPREL_PRE6_POSITION                              0x6
#define _APMPREL_PRE6_SIZE                                  0x1
#define _APMPREL_PRE6_LENGTH                                0x1
#define _APMPREL_PRE6_MASK                                  0x40
#define _APMPREL_PRE7_POSN                                  0x7
#define _APMPREL_PRE7_POSITION                              0x7
#define _APMPREL_PRE7_SIZE                                  0x1
#define _APMPREL_PRE7_LENGTH                                0x1
#define _APMPREL_PRE7_MASK                                  0x80
#define _APMPREL_APMPRE_POSN                                0x0
#define _APMPREL_APMPRE_POSITION                            0x0
#define _APMPREL_APMPRE_SIZE                                0x8
#define _APMPREL_APMPRE_LENGTH                              0x8
#define _APMPREL_APMPRE_MASK                                0xFF
#define _APMPREL_APMPRE0_POSN                               0x0
#define _APMPREL_APMPRE0_POSITION                           0x0
#define _APMPREL_APMPRE0_SIZE                               0x1
#define _APMPREL_APMPRE0_LENGTH                             0x1
#define _APMPREL_APMPRE0_MASK                               0x1
#define _APMPREL_APMPRE1_POSN                               0x1
#define _APMPREL_APMPRE1_POSITION                           0x1
#define _APMPREL_APMPRE1_SIZE                               0x1
#define _APMPREL_APMPRE1_LENGTH                             0x1
#define _APMPREL_APMPRE1_MASK                               0x2
#define _APMPREL_APMPRE2_POSN                               0x2
#define _APMPREL_APMPRE2_POSITION                           0x2
#define _APMPREL_APMPRE2_SIZE                               0x1
#define _APMPREL_APMPRE2_LENGTH                             0x1
#define _APMPREL_APMPRE2_MASK                               0x4
#define _APMPREL_APMPRE3_POSN                               0x3
#define _APMPREL_APMPRE3_POSITION                           0x3
#define _APMPREL_APMPRE3_SIZE                               0x1
#define _APMPREL_APMPRE3_LENGTH                             0x1
#define _APMPREL_APMPRE3_MASK                               0x8
#define _APMPREL_APMPRE4_POSN                               0x4
#define _APMPREL_APMPRE4_POSITION                           0x4
#define _APMPREL_APMPRE4_SIZE                               0x1
#define _APMPREL_APMPRE4_LENGTH                             0x1
#define _APMPREL_APMPRE4_MASK                               0x10
#define _APMPREL_APMPRE5_POSN                               0x5
#define _APMPREL_APMPRE5_POSITION                           0x5
#define _APMPREL_APMPRE5_SIZE                               0x1
#define _APMPREL_APMPRE5_LENGTH                             0x1
#define _APMPREL_APMPRE5_MASK                               0x20
#define _APMPREL_APMPRE6_POSN                               0x6
#define _APMPREL_APMPRE6_POSITION                           0x6
#define _APMPREL_APMPRE6_SIZE                               0x1
#define _APMPREL_APMPRE6_LENGTH                             0x1
#define _APMPREL_APMPRE6_MASK                               0x40
#define _APMPREL_APMPRE7_POSN                               0x7
#define _APMPREL_APMPRE7_POSITION                           0x7
#define _APMPREL_APMPRE7_SIZE                               0x1
#define _APMPREL_APMPRE7_LENGTH                             0x1
#define _APMPREL_APMPRE7_MASK                               0x80

// Register: APMPREH
#define APMPREH APMPREH
extern volatile unsigned char           APMPREH             __at(0x1C2);
#ifndef _LIB_BUILD
asm("APMPREH equ 01C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRE                    :8;
    };
    struct {
        unsigned PRE8                   :1;
        unsigned PRE9                   :1;
        unsigned PRE10                  :1;
        unsigned PRE11                  :1;
        unsigned PRE12                  :1;
        unsigned PRE13                  :1;
        unsigned PRE14                  :1;
        unsigned PRE15                  :1;
    };
    struct {
        unsigned APMPRE                 :8;
    };
    struct {
        unsigned APMPRE8                :1;
        unsigned APMPRE9                :1;
        unsigned APMPRE10               :1;
        unsigned APMPRE11               :1;
        unsigned APMPRE12               :1;
        unsigned APMPRE13               :1;
        unsigned APMPRE14               :1;
        unsigned APMPRE15               :1;
    };
} APMPREHbits_t;
