GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
extern volatile unsigned char           SPI1SDIPPS          __at(0x26B);
#ifndef _LIB_BUILD
asm("SPI1SDIPPS equ 026Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SPI1SDIPPS0            :1;
        unsigned SPI1SDIPPS1            :1;
        unsigned SPI1SDIPPS2            :1;
        unsigned SPI1SDIPPS3            :1;
        unsigned SPI1SDIPPS4            :1;
        unsigned SPI1SDIPPS5            :1;
    };
    struct {
        unsigned SPI1SDIPPS             :6;
    };
} SPI1SDIPPSbits_t;
extern volatile SPI1SDIPPSbits_t SPI1SDIPPSbits __at(0x26B);
// bitfield macros
#define _SPI1SDIPPS_PIN_POSN                                0x0
#define _SPI1SDIPPS_PIN_POSITION                            0x0
#define _SPI1SDIPPS_PIN_SIZE                                0x3
#define _SPI1SDIPPS_PIN_LENGTH                              0x3
#define _SPI1SDIPPS_PIN_MASK                                0x7
#define _SPI1SDIPPS_PORT_POSN                               0x3
#define _SPI1SDIPPS_PORT_POSITION                           0x3
#define _SPI1SDIPPS_PORT_SIZE                               0x3
#define _SPI1SDIPPS_PORT_LENGTH                             0x3
#define _SPI1SDIPPS_PORT_MASK                               0x38
#define _SPI1SDIPPS_SPI1SDIPPS0_POSN                        0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_POSITION                    0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_MASK                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSN                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSITION                    0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_MASK                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSN                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSITION                    0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_MASK                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS3_POSN                        0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_POSITION                    0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_MASK                        0x8
#define _SPI1SDIPPS_SPI1SDIPPS4_POSN                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_POSITION                    0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_MASK                        0x10
#define _SPI1SDIPPS_SPI1SDIPPS5_POSN                        0x5
#define _SPI1SDIPPS_SPI1SDIPPS5_POSITION                    0x5
#define _SPI1SDIPPS_SPI1SDIPPS5_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS5_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS5_MASK                        0x20
#define _SPI1SDIPPS_SPI1SDIPPS_POSN                         0x0
#define _SPI1SDIPPS_SPI1SDIPPS_POSITION                     0x0
#define _SPI1SDIPPS_SPI1SDIPPS_SIZE                         0x6
#define _SPI1SDIPPS_SPI1SDIPPS_LENGTH                       0x6
#define _SPI1SDIPPS_SPI1SDIPPS_MASK                         0x3F

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
extern volatile unsigned char           SPI1SSPPS           __at(0x26C);
#ifndef _LIB_BUILD
asm("SPI1SSPPS equ 026Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SPI1SSPPS0             :1;
        unsigned SPI1SSPPS1             :1;
        unsigned SPI1SSPPS2             :1;
        unsigned SPI1SSPPS3             :1;
        unsigned SPI1SSPPS4             :1;
        unsigned SPI1SSPPS5             :1;
    };
    struct {
        unsigned SPI1SSPPS              :6;
    };
} SPI1SSPPSbits_t;
extern volatile SPI1SSPPSbits_t SPI1SSPPSbits __at(0x26C);
// bitfield macros
#define _SPI1SSPPS_PIN_POSN                                 0x0
#define _SPI1SSPPS_PIN_POSITION                             0x0
#define _SPI1SSPPS_PIN_SIZE                                 0x3
#define _SPI1SSPPS_PIN_LENGTH                               0x3
#define _SPI1SSPPS_PIN_MASK                                 0x7
#define _SPI1SSPPS_PORT_POSN                                0x3
#define _SPI1SSPPS_PORT_POSITION                            0x3
#define _SPI1SSPPS_PORT_SIZE                                0x3
#define _SPI1SSPPS_PORT_LENGTH                              0x3
#define _SPI1SSPPS_PORT_MASK                                0x38
#define _SPI1SSPPS_SPI1SSPPS0_POSN                          0x0
#define _SPI1SSPPS_SPI1SSPPS0_POSITION                      0x0
#define _SPI1SSPPS_SPI1SSPPS0_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS0_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS0_MASK                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSN                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSITION                      0x1
#define _SPI1SSPPS_SPI1SSPPS1_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS1_MASK                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSN                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSITION                      0x2
#define _SPI1SSPPS_SPI1SSPPS2_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS2_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS2_MASK                          0x4
#define _SPI1SSPPS_SPI1SSPPS3_POSN                          0x3
#define _SPI1SSPPS_SPI1SSPPS3_POSITION                      0x3
#define _SPI1SSPPS_SPI1SSPPS3_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS3_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS3_MASK                          0x8
#define _SPI1SSPPS_SPI1SSPPS4_POSN                          0x4
#define _SPI1SSPPS_SPI1SSPPS4_POSITION                      0x4
#define _SPI1SSPPS_SPI1SSPPS4_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS4_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS4_MASK                          0x10
#define _SPI1SSPPS_SPI1SSPPS5_POSN                          0x5
#define _SPI1SSPPS_SPI1SSPPS5_POSITION                      0x5
#define _SPI1SSPPS_SPI1SSPPS5_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS5_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS5_MASK                          0x20
#define _SPI1SSPPS_SPI1SSPPS_POSN                           0x0
#define _SPI1SSPPS_SPI1SSPPS_POSITION                       0x0
#define _SPI1SSPPS_SPI1SSPPS_SIZE                           0x6
#define _SPI1SSPPS_SPI1SSPPS_LENGTH                         0x6
#define _SPI1SSPPS_SPI1SSPPS_MASK                           0x3F

