GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
extern volatile U1ERRIEbits_t U1ERRIEbits __at(0x2B2);
// bitfield macros
#define _U1ERRIE_TXCIE_POSN                                 0x0
#define _U1ERRIE_TXCIE_POSITION                             0x0
#define _U1ERRIE_TXCIE_SIZE                                 0x1
#define _U1ERRIE_TXCIE_LENGTH                               0x1
#define _U1ERRIE_TXCIE_MASK                                 0x1
#define _U1ERRIE_RXFOIE_POSN                                0x1
#define _U1ERRIE_RXFOIE_POSITION                            0x1
#define _U1ERRIE_RXFOIE_SIZE                                0x1
#define _U1ERRIE_RXFOIE_LENGTH                              0x1
#define _U1ERRIE_RXFOIE_MASK                                0x2
#define _U1ERRIE_RXBKIE_POSN                                0x2
#define _U1ERRIE_RXBKIE_POSITION                            0x2
#define _U1ERRIE_RXBKIE_SIZE                                0x1
#define _U1ERRIE_RXBKIE_LENGTH                              0x1
#define _U1ERRIE_RXBKIE_MASK                                0x4
#define _U1ERRIE_FERIE_POSN                                 0x3
#define _U1ERRIE_FERIE_POSITION                             0x3
#define _U1ERRIE_FERIE_SIZE                                 0x1
#define _U1ERRIE_FERIE_LENGTH                               0x1
#define _U1ERRIE_FERIE_MASK                                 0x8
#define _U1ERRIE_CERIE_POSN                                 0x4
#define _U1ERRIE_CERIE_POSITION                             0x4
#define _U1ERRIE_CERIE_SIZE                                 0x1
#define _U1ERRIE_CERIE_LENGTH                               0x1
#define _U1ERRIE_CERIE_MASK                                 0x10
#define _U1ERRIE_ABDOVE_POSN                                0x5
#define _U1ERRIE_ABDOVE_POSITION                            0x5
#define _U1ERRIE_ABDOVE_SIZE                                0x1
#define _U1ERRIE_ABDOVE_LENGTH                              0x1
#define _U1ERRIE_ABDOVE_MASK                                0x20
#define _U1ERRIE_PERIE_POSN                                 0x6
#define _U1ERRIE_PERIE_POSITION                             0x6
#define _U1ERRIE_PERIE_SIZE                                 0x1
#define _U1ERRIE_PERIE_LENGTH                               0x1
#define _U1ERRIE_PERIE_MASK                                 0x40
#define _U1ERRIE_TXMTIE_POSN                                0x7
#define _U1ERRIE_TXMTIE_POSITION                            0x7
#define _U1ERRIE_TXMTIE_SIZE                                0x1
#define _U1ERRIE_TXMTIE_LENGTH                              0x1
#define _U1ERRIE_TXMTIE_MASK                                0x80
#define _U1ERRIE_U1TXCIE_POSN                               0x0
#define _U1ERRIE_U1TXCIE_POSITION                           0x0
#define _U1ERRIE_U1TXCIE_SIZE                               0x1
#define _U1ERRIE_U1TXCIE_LENGTH                             0x1
#define _U1ERRIE_U1TXCIE_MASK                               0x1
#define _U1ERRIE_U1RXFOIE_POSN                              0x1
#define _U1ERRIE_U1RXFOIE_POSITION                          0x1
#define _U1ERRIE_U1RXFOIE_SIZE                              0x1
#define _U1ERRIE_U1RXFOIE_LENGTH                            0x1
#define _U1ERRIE_U1RXFOIE_MASK                              0x2
#define _U1ERRIE_U1RXBKIE_POSN                              0x2
#define _U1ERRIE_U1RXBKIE_POSITION                          0x2
#define _U1ERRIE_U1RXBKIE_SIZE                              0x1
#define _U1ERRIE_U1RXBKIE_LENGTH                            0x1
#define _U1ERRIE_U1RXBKIE_MASK                              0x4
#define _U1ERRIE_U1FERIE_POSN                               0x3
#define _U1ERRIE_U1FERIE_POSITION                           0x3
#define _U1ERRIE_U1FERIE_SIZE                               0x1
#define _U1ERRIE_U1FERIE_LENGTH                             0x1
#define _U1ERRIE_U1FERIE_MASK                               0x8
#define _U1ERRIE_U1CERIE_POSN                               0x4
#define _U1ERRIE_U1CERIE_POSITION                           0x4
#define _U1ERRIE_U1CERIE_SIZE                               0x1
#define _U1ERRIE_U1CERIE_LENGTH                             0x1
#define _U1ERRIE_U1CERIE_MASK                               0x10
#define _U1ERRIE_U1ABDOVE_POSN                              0x5
#define _U1ERRIE_U1ABDOVE_POSITION                          0x5
#define _U1ERRIE_U1ABDOVE_SIZE                              0x1
#define _U1ERRIE_U1ABDOVE_LENGTH                            0x1
#define _U1ERRIE_U1ABDOVE_MASK                              0x20
#define _U1ERRIE_U1PERIE_POSN                               0x6
#define _U1ERRIE_U1PERIE_POSITION                           0x6
#define _U1ERRIE_U1PERIE_SIZE                               0x1
#define _U1ERRIE_U1PERIE_LENGTH                             0x1
#define _U1ERRIE_U1PERIE_MASK                               0x40
#define _U1ERRIE_U1TXMTIE_POSN                              0x7
#define _U1ERRIE_U1TXMTIE_POSITION                          0x7
#define _U1ERRIE_U1TXMTIE_SIZE                              0x1
#define _U1ERRIE_U1TXMTIE_LENGTH                            0x1
#define _U1ERRIE_U1TXMTIE_MASK                              0x80

// Register: U2RXB
#define U2RXB U2RXB
extern volatile unsigned char           U2RXB               __at(0x2B4);
#ifndef _LIB_BUILD
asm("U2RXB equ 02B4h");
#endif
// aliases
extern volatile unsigned char           U2RXBL              __at(0x2B4);
#ifndef _LIB_BUILD
asm("U2RXBL equ 02B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBbits_t;
extern volatile U2RXBbits_t U2RXBbits __at(0x2B4);
// bitfield macros
#define _U2RXB_RXB_POSN                                     0x0
#define _U2RXB_RXB_POSITION                                 0x0
#define _U2RXB_RXB_SIZE                                     0x8
#define _U2RXB_RXB_LENGTH                                   0x8
#define _U2RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBLbits_t;
extern volatile U2RXBLbits_t U2RXBLbits __at(0x2B4);
// bitfield macros
#define _U2RXBL_RXB_POSN                                    0x0
#define _U2RXBL_RXB_POSITION                                0x0
#define _U2RXBL_RXB_SIZE                                    0x8
#define _U2RXBL_RXB_LENGTH                                  0x8
#define _U2RXBL_RXB_MASK                                    0xFF

// Register: U2TXB
#define U2TXB U2TXB
extern volatile unsigned char           U2TXB               __at(0x2B6);
#ifndef _LIB_BUILD
asm("U2TXB equ 02B6h");
#endif
// aliases
extern volatile unsigned char           U2TXBL              __at(0x2B6);
#ifndef _LIB_BUILD
asm("U2TXBL equ 02B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBbits_t;
extern volatile U2TXBbits_t U2TXBbits __at(0x2B6);
// bitfield macros
#define _U2TXB_TXB_POSN                                     0x0
#define _U2TXB_TXB_POSITION                                 0x0
#define _U2TXB_TXB_SIZE                                     0x8
#define _U2TXB_TXB_LENGTH                                   0x8
#define _U2TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBLbits_t;
extern volatile U2TXBLbits_t U2TXBLbits __at(0x2B6);
// bitfield macros
#define _U2TXBL_TXB_POSN                                    0x0
#define _U2TXBL_TXB_POSITION                                0x0
#define _U2TXBL_TXB_SIZE                                    0x8
#define _U2TXBL_TXB_LENGTH                                  0x8
#define _U2TXBL_TXB_MASK                                    0xFF

