GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
extern volatile IOCENbits_t IOCENbits __at(0x426);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x427);
#ifndef _LIB_BUILD
asm("IOCEF equ 0427h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x427);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: IOCWP
#define IOCWP IOCWP
extern volatile unsigned char           IOCWP               __at(0x43D);
#ifndef _LIB_BUILD
asm("IOCWP equ 043Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWP0                 :1;
        unsigned IOCWP1                 :1;
        unsigned IOCWP2                 :1;
        unsigned IOCWP3                 :1;
        unsigned IOCWP4                 :1;
        unsigned IOCWP5                 :1;
        unsigned IOCWP6                 :1;
        unsigned IOCWP7                 :1;
    };
} IOCWPbits_t;
extern volatile IOCWPbits_t IOCWPbits __at(0x43D);
// bitfield macros
#define _IOCWP_IOCWP0_POSN                                  0x0
#define _IOCWP_IOCWP0_POSITION                              0x0
#define _IOCWP_IOCWP0_SIZE                                  0x1
#define _IOCWP_IOCWP0_LENGTH                                0x1
#define _IOCWP_IOCWP0_MASK                                  0x1
#define _IOCWP_IOCWP1_POSN                                  0x1
#define _IOCWP_IOCWP1_POSITION                              0x1
#define _IOCWP_IOCWP1_SIZE                                  0x1
#define _IOCWP_IOCWP1_LENGTH                                0x1
#define _IOCWP_IOCWP1_MASK                                  0x2
#define _IOCWP_IOCWP2_POSN                                  0x2
#define _IOCWP_IOCWP2_POSITION                              0x2
#define _IOCWP_IOCWP2_SIZE                                  0x1
#define _IOCWP_IOCWP2_LENGTH                                0x1
#define _IOCWP_IOCWP2_MASK                                  0x4
#define _IOCWP_IOCWP3_POSN                                  0x3
#define _IOCWP_IOCWP3_POSITION                              0x3
#define _IOCWP_IOCWP3_SIZE                                  0x1
#define _IOCWP_IOCWP3_LENGTH                                0x1
#define _IOCWP_IOCWP3_MASK                                  0x8
#define _IOCWP_IOCWP4_POSN                                  0x4
#define _IOCWP_IOCWP4_POSITION                              0x4
#define _IOCWP_IOCWP4_SIZE                                  0x1
#define _IOCWP_IOCWP4_LENGTH                                0x1
#define _IOCWP_IOCWP4_MASK                                  0x10
#define _IOCWP_IOCWP5_POSN                                  0x5
#define _IOCWP_IOCWP5_POSITION                              0x5
#define _IOCWP_IOCWP5_SIZE                                  0x1
#define _IOCWP_IOCWP5_LENGTH                                0x1
#define _IOCWP_IOCWP5_MASK                                  0x20
#define _IOCWP_IOCWP6_POSN                                  0x6
#define _IOCWP_IOCWP6_POSITION                              0x6
#define _IOCWP_IOCWP6_SIZE                                  0x1
#define _IOCWP_IOCWP6_LENGTH                                0x1
#define _IOCWP_IOCWP6_MASK                                  0x40
#define _IOCWP_IOCWP7_POSN                                  0x7
#define _IOCWP_IOCWP7_POSITION                              0x7
#define _IOCWP_IOCWP7_SIZE                                  0x1
#define _IOCWP_IOCWP7_LENGTH                                0x1
#define _IOCWP_IOCWP7_MASK                                  0x80

// Register: IOCWN
#define IOCWN IOCWN
extern volatile unsigned char           IOCWN               __at(0x43E);
#ifndef _LIB_BUILD
asm("IOCWN equ 043Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWN0                 :1;
        unsigned IOCWN1                 :1;
        unsigned IOCWN2                 :1;
        unsigned IOCWN3                 :1;
        unsigned IOCWN4                 :1;
        unsigned IOCWN5                 :1;
        unsigned IOCWN6                 :1;
        unsigned IOCWN7                 :1;
    };
} IOCWNbits_t;
extern volatile IOCWNbits_t IOCWNbits __at(0x43E);
// bitfield macros
#define _IOCWN_IOCWN0_POSN                                  0x0
#define _IOCWN_IOCWN0_POSITION                              0x0
#define _IOCWN_IOCWN0_SIZE                                  0x1
#define _IOCWN_IOCWN0_LENGTH                                0x1
#define _IOCWN_IOCWN0_MASK                                  0x1
#define _IOCWN_IOCWN1_POSN                                  0x1
#define _IOCWN_IOCWN1_POSITION                              0x1
#define _IOCWN_IOCWN1_SIZE                                  0x1
#define _IOCWN_IOCWN1_LENGTH                                0x1
#define _IOCWN_IOCWN1_MASK                                  0x2
#define _IOCWN_IOCWN2_POSN                                  0x2
#define _IOCWN_IOCWN2_POSITION                              0x2
#define _IOCWN_IOCWN2_SIZE                                  0x1
#define _IOCWN_IOCWN2_LENGTH                                0x1
#define _IOCWN_IOCWN2_MASK                                  0x4
#define _IOCWN_IOCWN3_POSN                                  0x3
#define _IOCWN_IOCWN3_POSITION                              0x3
#define _IOCWN_IOCWN3_SIZE                                  0x1
#define _IOCWN_IOCWN3_LENGTH                                0x1
#define _IOCWN_IOCWN3_MASK                                  0x8
#define _IOCWN_IOCWN4_POSN                                  0x4
#define _IOCWN_IOCWN4_POSITION                              0x4
#define _IOCWN_IOCWN4_SIZE                                  0x1
#define _IOCWN_IOCWN4_LENGTH                                0x1
#define _IOCWN_IOCWN4_MASK                                  0x10
#define _IOCWN_IOCWN5_POSN                                  0x5
#define _IOCWN_IOCWN5_POSITION                              0x5
#define _IOCWN_IOCWN5_SIZE                                  0x1
#define _IOCWN_IOCWN5_LENGTH                                0x1
#define _IOCWN_IOCWN5_MASK                                  0x20
#define _IOCWN_IOCWN6_POSN                                  0x6
#define _IOCWN_IOCWN6_POSITION                              0x6
#define _IOCWN_IOCWN6_SIZE                                  0x1
#define _IOCWN_IOCWN6_LENGTH                                0x1
#define _IOCWN_IOCWN6_MASK                                  0x40
#define _IOCWN_IOCWN7_POSN                                  0x7
#define _IOCWN_IOCWN7_POSITION                              0x7
#define _IOCWN_IOCWN7_SIZE                                  0x1
#define _IOCWN_IOCWN7_LENGTH                                0x1
#define _IOCWN_IOCWN7_MASK                                  0x80

// Register: IOCWF
#define IOCWF IOCWF
extern volatile unsigned char           IOCWF               __at(0x43F);
#ifndef _LIB_BUILD
asm("IOCWF equ 043Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWF0                 :1;
        unsigned IOCWF1                 :1;
        unsigned IOCWF2                 :1;
        unsigned IOCWF3                 :1;
        unsigned IOCWF4                 :1;
        unsigned IOCWF5                 :1;
        unsigned IOCWF6                 :1;
        unsigned IOCWF7                 :1;
    };
} IOCWFbits_t;
extern volatile IOCWFbits_t IOCWFbits __at(0x43F);
// bitfield macros
#define _IOCWF_IOCWF0_POSN                                  0x0
#define _IOCWF_IOCWF0_POSITION                              0x0
#define _IOCWF_IOCWF0_SIZE                                  0x1
#define _IOCWF_IOCWF0_LENGTH                                0x1
#define _IOCWF_IOCWF0_MASK                                  0x1
#define _IOCWF_IOCWF1_POSN                                  0x1
#define _IOCWF_IOCWF1_POSITION                              0x1
#define _IOCWF_IOCWF1_SIZE                                  0x1
#define _IOCWF_IOCWF1_LENGTH                                0x1
#define _IOCWF_IOCWF1_MASK                                  0x2
#define _IOCWF_IOCWF2_POSN                                  0x2
#define _IOCWF_IOCWF2_POSITION                              0x2
#define _IOCWF_IOCWF2_SIZE                                  0x1
#define _IOCWF_IOCWF2_LENGTH                                0x1
#define _IOCWF_IOCWF2_MASK                                  0x4
#define _IOCWF_IOCWF3_POSN                                  0x3
#define _IOCWF_IOCWF3_POSITION                              0x3
#define _IOCWF_IOCWF3_SIZE                                  0x1
#define _IOCWF_IOCWF3_LENGTH                                0x1
#define _IOCWF_IOCWF3_MASK                                  0x8
#define _IOCWF_IOCWF4_POSN                                  0x4
#define _IOCWF_IOCWF4_POSITION                              0x4
#define _IOCWF_IOCWF4_SIZE                                  0x1
#define _IOCWF_IOCWF4_LENGTH                                0x1
#define _IOCWF_IOCWF4_MASK                                  0x10
#define _IOCWF_IOCWF5_POSN                                  0x5
#define _IOCWF_IOCWF5_POSITION                              0x5
#define _IOCWF_IOCWF5_SIZE                                  0x1
#define _IOCWF_IOCWF5_LENGTH                                0x1
#define _IOCWF_IOCWF5_MASK                                  0x20
#define _IOCWF_IOCWF6_POSN                                  0x6
#define _IOCWF_IOCWF6_POSITION                              0x6
#define _IOCWF_IOCWF6_SIZE                                  0x1
#define _IOCWF_IOCWF6_LENGTH                                0x1
#define _IOCWF_IOCWF6_MASK                                  0x40
#define _IOCWF_IOCWF7_POSN                                  0x7
#define _IOCWF_IOCWF7_POSITION                              0x7
#define _IOCWF_IOCWF7_SIZE                                  0x1
#define _IOCWF_IOCWF7_LENGTH                                0x1
#define _IOCWF_IOCWF7_MASK                                  0x80

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
#ifndef __CCI__
extern volatile __uint24                NCO1ACC             __at(0x440);
#endif
#ifndef _LIB_BUILD
asm("NCO1ACC equ 0440h");
#endif

