GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x4A0);
#ifndef _LIB_BUILD
asm("IPR4 equ 04A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1EIP                  :1;
        unsigned U1IP                   :1;
        unsigned TMR3IP                 :1;
        unsigned TMR3GIP                :1;
        unsigned PWM1PIP                :1;
        unsigned PWM1IP                 :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x4A0);
// bitfield macros
#define _IPR4_U1RXIP_POSN                                   0x0
#define _IPR4_U1RXIP_POSITION                               0x0
#define _IPR4_U1RXIP_SIZE                                   0x1
#define _IPR4_U1RXIP_LENGTH                                 0x1
#define _IPR4_U1RXIP_MASK                                   0x1
#define _IPR4_U1TXIP_POSN                                   0x1
#define _IPR4_U1TXIP_POSITION                               0x1
#define _IPR4_U1TXIP_SIZE                                   0x1
#define _IPR4_U1TXIP_LENGTH                                 0x1
#define _IPR4_U1TXIP_MASK                                   0x2
#define _IPR4_U1EIP_POSN                                    0x2
#define _IPR4_U1EIP_POSITION                                0x2
#define _IPR4_U1EIP_SIZE                                    0x1
#define _IPR4_U1EIP_LENGTH                                  0x1
#define _IPR4_U1EIP_MASK                                    0x4
#define _IPR4_U1IP_POSN                                     0x3
#define _IPR4_U1IP_POSITION                                 0x3
#define _IPR4_U1IP_SIZE                                     0x1
#define _IPR4_U1IP_LENGTH                                   0x1
#define _IPR4_U1IP_MASK                                     0x8
#define _IPR4_TMR3IP_POSN                                   0x4
#define _IPR4_TMR3IP_POSITION                               0x4
#define _IPR4_TMR3IP_SIZE                                   0x1
#define _IPR4_TMR3IP_LENGTH                                 0x1
#define _IPR4_TMR3IP_MASK                                   0x10
#define _IPR4_TMR3GIP_POSN                                  0x5
#define _IPR4_TMR3GIP_POSITION                              0x5
#define _IPR4_TMR3GIP_SIZE                                  0x1
#define _IPR4_TMR3GIP_LENGTH                                0x1
#define _IPR4_TMR3GIP_MASK                                  0x20
#define _IPR4_PWM1PIP_POSN                                  0x6
#define _IPR4_PWM1PIP_POSITION                              0x6
#define _IPR4_PWM1PIP_SIZE                                  0x1
#define _IPR4_PWM1PIP_LENGTH                                0x1
#define _IPR4_PWM1PIP_MASK                                  0x40
#define _IPR4_PWM1IP_POSN                                   0x7
#define _IPR4_PWM1IP_POSITION                               0x7
#define _IPR4_PWM1IP_SIZE                                   0x1
#define _IPR4_PWM1IP_LENGTH                                 0x1
#define _IPR4_PWM1IP_MASK                                   0x80

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x4A1);
#ifndef _LIB_BUILD
asm("IPR5 equ 04A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC6IP                 :1;
        unsigned TU16AIP                :1;
        unsigned                        :1;
        unsigned C2IP                   :1;
        unsigned CLC2IP                 :1;
        unsigned PWM2PIP                :1;
        unsigned PWM2IP                 :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x4A1);
// bitfield macros
#define _IPR5_CLC6IP_POSN                                   0x1
#define _IPR5_CLC6IP_POSITION                               0x1
#define _IPR5_CLC6IP_SIZE                                   0x1
#define _IPR5_CLC6IP_LENGTH                                 0x1
#define _IPR5_CLC6IP_MASK                                   0x2
#define _IPR5_TU16AIP_POSN                                  0x2
#define _IPR5_TU16AIP_POSITION                              0x2
#define _IPR5_TU16AIP_SIZE                                  0x1
#define _IPR5_TU16AIP_LENGTH                                0x1
#define _IPR5_TU16AIP_MASK                                  0x4
#define _IPR5_C2IP_POSN                                     0x4
#define _IPR5_C2IP_POSITION                                 0x4
#define _IPR5_C2IP_SIZE                                     0x1
#define _IPR5_C2IP_LENGTH                                   0x1
#define _IPR5_C2IP_MASK                                     0x10
#define _IPR5_CLC2IP_POSN                                   0x5
#define _IPR5_CLC2IP_POSITION                               0x5
#define _IPR5_CLC2IP_SIZE                                   0x1
#define _IPR5_CLC2IP_LENGTH                                 0x1
#define _IPR5_CLC2IP_MASK                                   0x20
#define _IPR5_PWM2PIP_POSN                                  0x6
#define _IPR5_PWM2PIP_POSITION                              0x6
#define _IPR5_PWM2PIP_SIZE                                  0x1
#define _IPR5_PWM2PIP_LENGTH                                0x1
#define _IPR5_PWM2PIP_MASK                                  0x40
#define _IPR5_PWM2IP_POSN                                   0x7
#define _IPR5_PWM2IP_POSITION                               0x7
#define _IPR5_PWM2IP_SIZE                                   0x1
#define _IPR5_PWM2IP_LENGTH                                 0x1
#define _IPR5_PWM2IP_MASK                                   0x80

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x4A2);
#ifndef _LIB_BUILD
asm("IPR6 equ 04A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IP                 :1;
        unsigned CLC7IP                 :1;
        unsigned CWG1IP                 :1;
        unsigned NCO1IP                 :1;
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0x4A2);
// bitfield macros
#define _IPR6_INT1IP_POSN                                   0x0
#define _IPR6_INT1IP_POSITION                               0x0
#define _IPR6_INT1IP_SIZE                                   0x1
#define _IPR6_INT1IP_LENGTH                                 0x1
#define _IPR6_INT1IP_MASK                                   0x1
#define _IPR6_CLC7IP_POSN                                   0x1
#define _IPR6_CLC7IP_POSITION                               0x1
#define _IPR6_CLC7IP_SIZE                                   0x1
#define _IPR6_CLC7IP_LENGTH                                 0x1
#define _IPR6_CLC7IP_MASK                                   0x2
#define _IPR6_CWG1IP_POSN                                   0x2
#define _IPR6_CWG1IP_POSITION                               0x2
#define _IPR6_CWG1IP_SIZE                                   0x1
#define _IPR6_CWG1IP_LENGTH                                 0x1
#define _IPR6_CWG1IP_MASK                                   0x4
#define _IPR6_NCO1IP_POSN                                   0x3
#define _IPR6_NCO1IP_POSITION                               0x3
#define _IPR6_NCO1IP_SIZE                                   0x1
#define _IPR6_NCO1IP_LENGTH                                 0x1
#define _IPR6_NCO1IP_MASK                                   0x8
#define _IPR6_DMA2SCNTIP_POSN                               0x4
#define _IPR6_DMA2SCNTIP_POSITION                           0x4
#define _IPR6_DMA2SCNTIP_SIZE                               0x1
#define _IPR6_DMA2SCNTIP_LENGTH                             0x1
#define _IPR6_DMA2SCNTIP_MASK                               0x10
#define _IPR6_DMA2DCNTIP_POSN                               0x5
#define _IPR6_DMA2DCNTIP_POSITION                           0x5
#define _IPR6_DMA2DCNTIP_SIZE                               0x1
#define _IPR6_DMA2DCNTIP_LENGTH                             0x1
#define _IPR6_DMA2DCNTIP_MASK                               0x20
#define _IPR6_DMA2ORIP_POSN                                 0x6
#define _IPR6_DMA2ORIP_POSITION                             0x6
#define _IPR6_DMA2ORIP_SIZE                                 0x1
#define _IPR6_DMA2ORIP_LENGTH                               0x1
#define _IPR6_DMA2ORIP_MASK                                 0x40
#define _IPR6_DMA2AIP_POSN                                  0x7
#define _IPR6_DMA2AIP_POSITION                              0x7
#define _IPR6_DMA2AIP_SIZE                                  0x1
#define _IPR6_DMA2AIP_LENGTH                                0x1
#define _IPR6_DMA2AIP_MASK                                  0x80

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x4A3);
#ifndef _LIB_BUILD
asm("IPR7 equ 04A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIP               :1;
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
        unsigned                        :1;
        unsigned CLC3IP                 :1;
        unsigned PWM3PIP                :1;
        unsigned PWM3IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x4A3);
// bitfield macros
#define _IPR7_I2C1RXIP_POSN                                 0x0
#define _IPR7_I2C1RXIP_POSITION                             0x0
#define _IPR7_I2C1RXIP_SIZE                                 0x1
#define _IPR7_I2C1RXIP_LENGTH                               0x1
#define _IPR7_I2C1RXIP_MASK                                 0x1
#define _IPR7_I2C1TXIP_POSN                                 0x1
#define _IPR7_I2C1TXIP_POSITION                             0x1
#define _IPR7_I2C1TXIP_SIZE                                 0x1
#define _IPR7_I2C1TXIP_LENGTH                               0x1
#define _IPR7_I2C1TXIP_MASK                                 0x2
#define _IPR7_I2C1IP_POSN                                   0x2
#define _IPR7_I2C1IP_POSITION                               0x2
#define _IPR7_I2C1IP_SIZE                                   0x1
#define _IPR7_I2C1IP_LENGTH                                 0x1
#define _IPR7_I2C1IP_MASK                                   0x4
#define _IPR7_I2C1EIP_POSN                                  0x3
#define _IPR7_I2C1EIP_POSITION                              0x3
#define _IPR7_I2C1EIP_SIZE                                  0x1
#define _IPR7_I2C1EIP_LENGTH                                0x1
#define _IPR7_I2C1EIP_MASK                                  0x8
#define _IPR7_CLC3IP_POSN                                   0x5
#define _IPR7_CLC3IP_POSITION                               0x5
#define _IPR7_CLC3IP_SIZE                                   0x1
#define _IPR7_CLC3IP_LENGTH                                 0x1
#define _IPR7_CLC3IP_MASK                                   0x20
#define _IPR7_PWM3PIP_POSN                                  0x6
#define _IPR7_PWM3PIP_POSITION                              0x6
#define _IPR7_PWM3PIP_SIZE                                  0x1
#define _IPR7_PWM3PIP_LENGTH                                0x1
#define _IPR7_PWM3PIP_MASK                                  0x40
#define _IPR7_PWM3IP_POSN                                   0x7
#define _IPR7_PWM3IP_POSITION                               0x7
#define _IPR7_PWM3IP_SIZE                                   0x1
#define _IPR7_PWM3IP_LENGTH                                 0x1
#define _IPR7_PWM3IP_MASK                                   0x80

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x4A4);
#ifndef _LIB_BUILD
asm("IPR8 equ 04A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2EIP                  :1;
        unsigned U2IP                   :1;
        unsigned                        :1;
        unsigned CLC4IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned SCANIP                 :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0x4A4);
// bitfield macros
#define _IPR8_U2RXIP_POSN                                   0x0
#define _IPR8_U2RXIP_POSITION                               0x0
#define _IPR8_U2RXIP_SIZE                                   0x1
#define _IPR8_U2RXIP_LENGTH                                 0x1
#define _IPR8_U2RXIP_MASK                                   0x1
#define _IPR8_U2TXIP_POSN                                   0x1
#define _IPR8_U2TXIP_POSITION                               0x1
#define _IPR8_U2TXIP_SIZE                                   0x1
#define _IPR8_U2TXIP_LENGTH                                 0x1
#define _IPR8_U2TXIP_MASK                                   0x2
#define _IPR8_U2EIP_POSN                                    0x2
#define _IPR8_U2EIP_POSITION                                0x2
#define _IPR8_U2EIP_SIZE                                    0x1
#define _IPR8_U2EIP_LENGTH                                  0x1
#define _IPR8_U2EIP_MASK                                    0x4
#define _IPR8_U2IP_POSN                                     0x3
#define _IPR8_U2IP_POSITION                                 0x3
#define _IPR8_U2IP_SIZE                                     0x1
#define _IPR8_U2IP_LENGTH                                   0x1
#define _IPR8_U2IP_MASK                                     0x8
#define _IPR8_CLC4IP_POSN                                   0x5
#define _IPR8_CLC4IP_POSITION                               0x5
#define _IPR8_CLC4IP_SIZE                                   0x1
#define _IPR8_CLC4IP_LENGTH                                 0x1
#define _IPR8_CLC4IP_MASK                                   0x20
#define _IPR8_CCP2IP_POSN                                   0x6
#define _IPR8_CCP2IP_POSITION                               0x6
#define _IPR8_CCP2IP_SIZE                                   0x1
#define _IPR8_CCP2IP_LENGTH                                 0x1
#define _IPR8_CCP2IP_MASK                                   0x40
#define _IPR8_SCANIP_POSN                                   0x7
#define _IPR8_SCANIP_POSITION                               0x7
#define _IPR8_SCANIP_SIZE                                   0x1
#define _IPR8_SCANIP_LENGTH                                 0x1
#define _IPR8_SCANIP_MASK                                   0x80

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0x4A5);
#ifndef _LIB_BUILD
asm("IPR9 equ 04A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned DMA3SCNTIP             :1;
        unsigned DMA3DCNTIP             :1;
        unsigned DMA3ORIP               :1;
        unsigned DMA3AIP                :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0x4A5);
// bitfield macros
#define _IPR9_DMA3SCNTIP_POSN                               0x4
#define _IPR9_DMA3SCNTIP_POSITION                           0x4
#define _IPR9_DMA3SCNTIP_SIZE                               0x1
#define _IPR9_DMA3SCNTIP_LENGTH                             0x1
#define _IPR9_DMA3SCNTIP_MASK                               0x10
#define _IPR9_DMA3DCNTIP_POSN                               0x5
#define _IPR9_DMA3DCNTIP_POSITION                           0x5
#define _IPR9_DMA3DCNTIP_SIZE                               0x1
#define _IPR9_DMA3DCNTIP_LENGTH                             0x1
#define _IPR9_DMA3DCNTIP_MASK                               0x20
#define _IPR9_DMA3ORIP_POSN                                 0x6
#define _IPR9_DMA3ORIP_POSITION                             0x6
#define _IPR9_DMA3ORIP_SIZE                                 0x1
#define _IPR9_DMA3ORIP_LENGTH                               0x1
#define _IPR9_DMA3ORIP_MASK                                 0x40
#define _IPR9_DMA3AIP_POSN                                  0x7
#define _IPR9_DMA3AIP_POSITION                              0x7
#define _IPR9_DMA3AIP_SIZE                                  0x1
#define _IPR9_DMA3AIP_LENGTH                                0x1
#define _IPR9_DMA3AIP_MASK                                  0x80

// Register: IPR10
#define IPR10 IPR10
extern volatile unsigned char           IPR10               __at(0x4A6);
#ifndef _LIB_BUILD
asm("IPR10 equ 04A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IP                 :1;
        unsigned CLC8IP                 :1;
        unsigned TU16BIP                :1;
        unsigned TMR4IP                 :1;
        unsigned DMA4SCNTIP             :1;
        unsigned DMA4DCNTIP             :1;
        unsigned DMA4ORIP               :1;
        unsigned DMA4AIP                :1;
    };
} IPR10bits_t;
extern volatile IPR10bits_t IPR10bits __at(0x4A6);
// bitfield macros
#define _IPR10_INT2IP_POSN                                  0x0
#define _IPR10_INT2IP_POSITION                              0x0
#define _IPR10_INT2IP_SIZE                                  0x1
#define _IPR10_INT2IP_LENGTH                                0x1
#define _IPR10_INT2IP_MASK                                  0x1
#define _IPR10_CLC8IP_POSN                                  0x1
#define _IPR10_CLC8IP_POSITION                              0x1
#define _IPR10_CLC8IP_SIZE                                  0x1
#define _IPR10_CLC8IP_LENGTH                                0x1
#define _IPR10_CLC8IP_MASK                                  0x2
#define _IPR10_TU16BIP_POSN                                 0x2
#define _IPR10_TU16BIP_POSITION                             0x2
#define _IPR10_TU16BIP_SIZE                                 0x1
#define _IPR10_TU16BIP_LENGTH                               0x1
#define _IPR10_TU16BIP_MASK                                 0x4
#define _IPR10_TMR4IP_POSN                                  0x3
#define _IPR10_TMR4IP_POSITION                              0x3
#define _IPR10_TMR4IP_SIZE                                  0x1
#define _IPR10_TMR4IP_LENGTH                                0x1
#define _IPR10_TMR4IP_MASK                                  0x8
#define _IPR10_DMA4SCNTIP_POSN                              0x4
#define _IPR10_DMA4SCNTIP_POSITION                          0x4
#define _IPR10_DMA4SCNTIP_SIZE                              0x1
#define _IPR10_DMA4SCNTIP_LENGTH                            0x1
#define _IPR10_DMA4SCNTIP_MASK                              0x10
#define _IPR10_DMA4DCNTIP_POSN                              0x5
#define _IPR10_DMA4DCNTIP_POSITION                          0x5
#define _IPR10_DMA4DCNTIP_SIZE                              0x1
#define _IPR10_DMA4DCNTIP_LENGTH                            0x1
#define _IPR10_DMA4DCNTIP_MASK                              0x20
#define _IPR10_DMA4ORIP_POSN                                0x6
#define _IPR10_DMA4ORIP_POSITION                            0x6
#define _IPR10_DMA4ORIP_SIZE                                0x1
#define _IPR10_DMA4ORIP_LENGTH                              0x1
#define _IPR10_DMA4ORIP_MASK                                0x40
#define _IPR10_DMA4AIP_POSN                                 0x7
#define _IPR10_DMA4AIP_POSITION                             0x7
#define _IPR10_DMA4AIP_SIZE                                 0x1
#define _IPR10_DMA4AIP_LENGTH                               0x1
#define _IPR10_DMA4AIP_MASK                                 0x80

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x4A7);
#ifndef _LIB_BUILD
asm("PIE0 equ 04A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned HLVDIE                 :1;
        unsigned OSFIE                  :1;
        unsigned CSWIE                  :1;
        unsigned NVMIE                  :1;
        unsigned CLC1IE                 :1;
        unsigned CRCIE                  :1;
        unsigned IOCIE                  :1;
    };
} PIE0bits_t;
