GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
// IPR0<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x24E5);	// @ (0x49C * 8 + 5)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR0,5)
// PMD4<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD4,1)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x6A0);	// @ (0xD4 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x2565);	// @ (0x4AC * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x25BD);	// @ (0x4B7 * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x250D);	// @ (0x4A1 * 8 + 5)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR5,5)
// PMD4<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x332);	// @ (0x66 * 8 + 2)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD4,2)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x6A1);	// @ (0xD4 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE7<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x2575);	// @ (0x4AE * 8 + 5)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x25CD);	// @ (0x4B9 * 8 + 5)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x251D);	// @ (0x4A3 * 8 + 5)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR7,5)
// PMD4<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x333);	// @ (0x66 * 8 + 3)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD4,3)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x6A2);	// @ (0xD4 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE8<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x257D);	// @ (0x4AF * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE8,5)
// PIR8<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x25D5);	// @ (0x4BA * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR8,5)
// IPR8<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x2525);	// @ (0x4A4 * 8 + 5)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR8,5)
// PMD4<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x334);	// @ (0x66 * 8 + 4)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD4,4)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x6A3);	// @ (0xD4 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PIE2<CLC5IE>
extern volatile __bit                   CLC5IE              __at(0x2549);	// @ (0x4A9 * 8 + 1)
#define                                 CLC5IE_bit          _BIT_ACCESS(PIE2,1)
// PIR2<CLC5IF>
extern volatile __bit                   CLC5IF              __at(0x25A1);	// @ (0x4B4 * 8 + 1)
#define                                 CLC5IF_bit          _BIT_ACCESS(PIR2,1)
// IPR2<CLC5IP>
extern volatile __bit                   CLC5IP              __at(0x24F1);	// @ (0x49E * 8 + 1)
#define                                 CLC5IP_bit          _BIT_ACCESS(IPR2,1)
// PMD5<CLC5MD>
extern volatile __bit                   CLC5MD              __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 CLC5MD_bit          _BIT_ACCESS(PMD5,4)
// CLCDATA<CLC5OUT>
extern volatile __bit                   CLC5OUT             __at(0x6A4);	// @ (0xD4 * 8 + 4)
#define                                 CLC5OUT_bit         _BIT_ACCESS(CLCDATA,4)
// PIE5<CLC6IE>
extern volatile __bit                   CLC6IE              __at(0x2561);	// @ (0x4AC * 8 + 1)
#define                                 CLC6IE_bit          _BIT_ACCESS(PIE5,1)
// PIR5<CLC6IF>
extern volatile __bit                   CLC6IF              __at(0x25B9);	// @ (0x4B7 * 8 + 1)
#define                                 CLC6IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<CLC6IP>
extern volatile __bit                   CLC6IP              __at(0x2509);	// @ (0x4A1 * 8 + 1)
#define                                 CLC6IP_bit          _BIT_ACCESS(IPR5,1)
// PMD5<CLC6MD>
extern volatile __bit                   CLC6MD              __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 CLC6MD_bit          _BIT_ACCESS(PMD5,5)
// CLCDATA<CLC6OUT>
extern volatile __bit                   CLC6OUT             __at(0x6A5);	// @ (0xD4 * 8 + 5)
#define                                 CLC6OUT_bit         _BIT_ACCESS(CLCDATA,5)
// PIE6<CLC7IE>
extern volatile __bit                   CLC7IE              __at(0x2569);	// @ (0x4AD * 8 + 1)
#define                                 CLC7IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CLC7IF>
extern volatile __bit                   CLC7IF              __at(0x25C1);	// @ (0x4B8 * 8 + 1)
#define                                 CLC7IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CLC7IP>
extern volatile __bit                   CLC7IP              __at(0x2511);	// @ (0x4A2 * 8 + 1)
#define                                 CLC7IP_bit          _BIT_ACCESS(IPR6,1)
// PMD5<CLC7MD>
extern volatile __bit                   CLC7MD              __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 CLC7MD_bit          _BIT_ACCESS(PMD5,6)
// CLCDATA<CLC7OUT>
extern volatile __bit                   CLC7OUT             __at(0x6A6);	// @ (0xD4 * 8 + 6)
#define                                 CLC7OUT_bit         _BIT_ACCESS(CLCDATA,6)
// PIE10<CLC8IE>
extern volatile __bit                   CLC8IE              __at(0x2589);	// @ (0x4B1 * 8 + 1)
#define                                 CLC8IE_bit          _BIT_ACCESS(PIE10,1)
// PIR10<CLC8IF>
extern volatile __bit                   CLC8IF              __at(0x25E1);	// @ (0x4BC * 8 + 1)
#define                                 CLC8IF_bit          _BIT_ACCESS(PIR10,1)
// IPR10<CLC8IP>
extern volatile __bit                   CLC8IP              __at(0x2531);	// @ (0x4A6 * 8 + 1)
#define                                 CLC8IP_bit          _BIT_ACCESS(IPR10,1)
// PMD5<CLC8MD>
extern volatile __bit                   CLC8MD              __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 CLC8MD_bit          _BIT_ACCESS(PMD5,7)
// CLCDATA<CLC8OUT>
extern volatile __bit                   CLC8OUT             __at(0x6A7);	// @ (0xD4 * 8 + 7)
#define                                 CLC8OUT_bit         _BIT_ACCESS(CLCDATA,7)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x1308);	// @ (0x261 * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x1309);	// @ (0x261 * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x130A);	// @ (0x261 * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x130B);	// @ (0x261 * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x130C);	// @ (0x261 * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN0PPS<CLCIN0PPS5>
extern volatile __bit                   CLCIN0PPS5          __at(0x130D);	// @ (0x261 * 8 + 5)
#define                                 CLCIN0PPS5_bit      _BIT_ACCESS(CLCIN0PPS,5)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x1310);	// @ (0x262 * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x1311);	// @ (0x262 * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x1312);	// @ (0x262 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x1313);	// @ (0x262 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x1314);	// @ (0x262 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN1PPS<CLCIN1PPS5>
extern volatile __bit                   CLCIN1PPS5          __at(0x1315);	// @ (0x262 * 8 + 5)
#define                                 CLCIN1PPS5_bit      _BIT_ACCESS(CLCIN1PPS,5)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x1318);	// @ (0x263 * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x1319);	// @ (0x263 * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x131A);	// @ (0x263 * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x131B);	// @ (0x263 * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x131C);	// @ (0x263 * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN2PPS<CLCIN2PPS5>
extern volatile __bit                   CLCIN2PPS5          __at(0x131D);	// @ (0x263 * 8 + 5)
#define                                 CLCIN2PPS5_bit      _BIT_ACCESS(CLCIN2PPS,5)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x1320);	// @ (0x264 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x1321);	// @ (0x264 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x1322);	// @ (0x264 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x1323);	// @ (0x264 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x1324);	// @ (0x264 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN3PPS<CLCIN3PPS5>
extern volatile __bit                   CLCIN3PPS5          __at(0x1325);	// @ (0x264 * 8 + 5)
#define                                 CLCIN3PPS5_bit      _BIT_ACCESS(CLCIN3PPS,5)
// CLCIN4PPS<CLCIN4PPS0>
extern volatile __bit                   CLCIN4PPS0          __at(0x1328);	// @ (0x265 * 8 + 0)
#define                                 CLCIN4PPS0_bit      _BIT_ACCESS(CLCIN4PPS,0)
// CLCIN4PPS<CLCIN4PPS1>
extern volatile __bit                   CLCIN4PPS1          __at(0x1329);	// @ (0x265 * 8 + 1)
#define                                 CLCIN4PPS1_bit      _BIT_ACCESS(CLCIN4PPS,1)
// CLCIN4PPS<CLCIN4PPS2>
extern volatile __bit                   CLCIN4PPS2          __at(0x132A);	// @ (0x265 * 8 + 2)
#define                                 CLCIN4PPS2_bit      _BIT_ACCESS(CLCIN4PPS,2)
// CLCIN4PPS<CLCIN4PPS3>
extern volatile __bit                   CLCIN4PPS3          __at(0x132B);	// @ (0x265 * 8 + 3)
#define                                 CLCIN4PPS3_bit      _BIT_ACCESS(CLCIN4PPS,3)
// CLCIN4PPS<CLCIN4PPS4>
extern volatile __bit                   CLCIN4PPS4          __at(0x132C);	// @ (0x265 * 8 + 4)
#define                                 CLCIN4PPS4_bit      _BIT_ACCESS(CLCIN4PPS,4)
// CLCIN4PPS<CLCIN4PPS5>
extern volatile __bit                   CLCIN4PPS5          __at(0x132D);	// @ (0x265 * 8 + 5)
#define                                 CLCIN4PPS5_bit      _BIT_ACCESS(CLCIN4PPS,5)
// CLCIN5PPS<CLCIN5PPS0>
extern volatile __bit                   CLCIN5PPS0          __at(0x1330);	// @ (0x266 * 8 + 0)
#define                                 CLCIN5PPS0_bit      _BIT_ACCESS(CLCIN5PPS,0)
// CLCIN5PPS<CLCIN5PPS1>
extern volatile __bit                   CLCIN5PPS1          __at(0x1331);	// @ (0x266 * 8 + 1)
#define                                 CLCIN5PPS1_bit      _BIT_ACCESS(CLCIN5PPS,1)
// CLCIN5PPS<CLCIN5PPS2>
extern volatile __bit                   CLCIN5PPS2          __at(0x1332);	// @ (0x266 * 8 + 2)
#define                                 CLCIN5PPS2_bit      _BIT_ACCESS(CLCIN5PPS,2)
// CLCIN5PPS<CLCIN5PPS3>
extern volatile __bit                   CLCIN5PPS3          __at(0x1333);	// @ (0x266 * 8 + 3)
#define                                 CLCIN5PPS3_bit      _BIT_ACCESS(CLCIN5PPS,3)
// CLCIN5PPS<CLCIN5PPS4>
extern volatile __bit                   CLCIN5PPS4          __at(0x1334);	// @ (0x266 * 8 + 4)
#define                                 CLCIN5PPS4_bit      _BIT_ACCESS(CLCIN5PPS,4)
// CLCIN5PPS<CLCIN5PPS5>
extern volatile __bit                   CLCIN5PPS5          __at(0x1335);	// @ (0x266 * 8 + 5)
#define                                 CLCIN5PPS5_bit      _BIT_ACCESS(CLCIN5PPS,5)
// CLCIN6PPS<CLCIN6PPS0>
extern volatile __bit                   CLCIN6PPS0          __at(0x1338);	// @ (0x267 * 8 + 0)
#define                                 CLCIN6PPS0_bit      _BIT_ACCESS(CLCIN6PPS,0)
// CLCIN6PPS<CLCIN6PPS1>
extern volatile __bit                   CLCIN6PPS1          __at(0x1339);	// @ (0x267 * 8 + 1)
#define                                 CLCIN6PPS1_bit      _BIT_ACCESS(CLCIN6PPS,1)
// CLCIN6PPS<CLCIN6PPS2>
extern volatile __bit                   CLCIN6PPS2          __at(0x133A);	// @ (0x267 * 8 + 2)
#define                                 CLCIN6PPS2_bit      _BIT_ACCESS(CLCIN6PPS,2)
// CLCIN6PPS<CLCIN6PPS3>
extern volatile __bit                   CLCIN6PPS3          __at(0x133B);	// @ (0x267 * 8 + 3)
#define                                 CLCIN6PPS3_bit      _BIT_ACCESS(CLCIN6PPS,3)
// CLCIN6PPS<CLCIN6PPS4>
extern volatile __bit                   CLCIN6PPS4          __at(0x133C);	// @ (0x267 * 8 + 4)
#define                                 CLCIN6PPS4_bit      _BIT_ACCESS(CLCIN6PPS,4)
// CLCIN6PPS<CLCIN6PPS5>
extern volatile __bit                   CLCIN6PPS5          __at(0x133D);	// @ (0x267 * 8 + 5)
#define                                 CLCIN6PPS5_bit      _BIT_ACCESS(CLCIN6PPS,5)
// CLCIN7PPS<CLCIN7PPS0>
extern volatile __bit                   CLCIN7PPS0          __at(0x1340);	// @ (0x268 * 8 + 0)
#define                                 CLCIN7PPS0_bit      _BIT_ACCESS(CLCIN7PPS,0)
// CLCIN7PPS<CLCIN7PPS1>
extern volatile __bit                   CLCIN7PPS1          __at(0x1341);	// @ (0x268 * 8 + 1)
#define                                 CLCIN7PPS1_bit      _BIT_ACCESS(CLCIN7PPS,1)
// CLCIN7PPS<CLCIN7PPS2>
extern volatile __bit                   CLCIN7PPS2          __at(0x1342);	// @ (0x268 * 8 + 2)
#define                                 CLCIN7PPS2_bit      _BIT_ACCESS(CLCIN7PPS,2)
// CLCIN7PPS<CLCIN7PPS3>
extern volatile __bit                   CLCIN7PPS3          __at(0x1343);	// @ (0x268 * 8 + 3)
#define                                 CLCIN7PPS3_bit      _BIT_ACCESS(CLCIN7PPS,3)
// CLCIN7PPS<CLCIN7PPS4>
extern volatile __bit                   CLCIN7PPS4          __at(0x1344);	// @ (0x268 * 8 + 4)
#define                                 CLCIN7PPS4_bit      _BIT_ACCESS(CLCIN7PPS,4)
// CLCIN7PPS<CLCIN7PPS5>
extern volatile __bit                   CLCIN7PPS5          __at(0x1345);	// @ (0x268 * 8 + 5)
#define                                 CLCIN7PPS5_bit      _BIT_ACCESS(CLCIN7PPS,5)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x1D2);	// @ (0x3A * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x1D3);	// @ (0x3A * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x1CF);	// @ (0x39 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x311);	// @ (0x62 * 8 + 1)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,1)
// SPI1CLK<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 CLKSEL0_bit         _BIT_ACCESS(SPI1CLK,0)
// SPI1CLK<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0x461);	// @ (0x8C * 8 + 1)
#define                                 CLKSEL1_bit         _BIT_ACCESS(SPI1CLK,1)
// SPI1CLK<CLKSEL2>
extern volatile __bit                   CLKSEL2             __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 CLKSEL2_bit         _BIT_ACCESS(SPI1CLK,2)
// SPI1CLK<CLKSEL3>
extern volatile __bit                   CLKSEL3             __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 CLKSEL3_bit         _BIT_ACCESS(SPI1CLK,3)
// SPI1CLK<CLKSEL4>
extern volatile __bit                   CLKSEL4             __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 CLKSEL4_bit         _BIT_ACCESS(SPI1CLK,4)
// PMD1<CM1MD>
extern volatile __bit                   CM1MD               __at(0x31F);	// @ (0x63 * 8 + 7)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD1,7)
// PMD2<CM2MD>
extern volatile __bit                   CM2MD               __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD2,0)
// I2C1CNTH<CNT10>
extern volatile __bit                   CNT10               __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 CNT10_bit           _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<CNT11>
extern volatile __bit                   CNT11               __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 CNT11_bit           _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<CNT12>
extern volatile __bit                   CNT12               __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 CNT12_bit           _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<CNT13>
extern volatile __bit                   CNT13               __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 CNT13_bit           _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<CNT14>
extern volatile __bit                   CNT14               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 CNT14_bit           _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<CNT15>
extern volatile __bit                   CNT15               __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 CNT15_bit           _BIT_ACCESS(I2C1CNTH,7)
// I2C1PIE<CNT1IE>
extern volatile __bit                   CNT1IE              __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNT1IE_bit          _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNT1IF>
extern volatile __bit                   CNT1IF              __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNT1IF_bit          _BIT_ACCESS(I2C1PIR,7)
// I2C1CNTH<CNT8>
extern volatile __bit                   CNT8                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 CNT8_bit            _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<CNT9>
extern volatile __bit                   CNT9                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 CNT9_bit            _BIT_ACCESS(I2C1CNTH,1)
// I2C1PIE<CNTIE>
extern volatile __bit                   CNTIE               __at(0x14DF);	// @ (0x29B * 8 + 7)
#define                                 CNTIE_bit           _BIT_ACCESS(I2C1PIE,7)
// I2C1PIR<CNTIF>
extern volatile __bit                   CNTIF               __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 CNTIF_bit           _BIT_ACCESS(I2C1PIR,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0x1F9E);	// @ (0x3F3 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x574);	// @ (0xAE * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x575);	// @ (0xAE * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x576);	// @ (0xAE * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// ADCPCON<CPRDY>
extern volatile __bit                   CPRDY               __at(0x1EC0);	// @ (0x3D8 * 8 + 0)
#define                                 CPRDY_bit           _BIT_ACCESS(ADCPCON,0)
// CRCCON0<CRCBUSY>
