GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.h
#define                                 TU16BPR6_bit        _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPR7>
extern volatile __bit                   TU16BPR7            __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BPR7_bit        _BIT_ACCESS(TU16BPRL,7)
// TU16BPRH<TU16BPR8>
extern volatile __bit                   TU16BPR8            __at(0x1D88);	// @ (0x3B1 * 8 + 0)
#define                                 TU16BPR8_bit        _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPR9>
extern volatile __bit                   TU16BPR9            __at(0x1D89);	// @ (0x3B1 * 8 + 1)
#define                                 TU16BPR9_bit        _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH0>
extern volatile __bit                   TU16BPRH0           __at(0x1D88);	// @ (0x3B1 * 8 + 0)
#define                                 TU16BPRH0_bit       _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPRH1>
extern volatile __bit                   TU16BPRH1           __at(0x1D89);	// @ (0x3B1 * 8 + 1)
#define                                 TU16BPRH1_bit       _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH2>
extern volatile __bit                   TU16BPRH2           __at(0x1D8A);	// @ (0x3B1 * 8 + 2)
#define                                 TU16BPRH2_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPRH3>
extern volatile __bit                   TU16BPRH3           __at(0x1D8B);	// @ (0x3B1 * 8 + 3)
#define                                 TU16BPRH3_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPRH4>
extern volatile __bit                   TU16BPRH4           __at(0x1D8C);	// @ (0x3B1 * 8 + 4)
#define                                 TU16BPRH4_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPRH5>
extern volatile __bit                   TU16BPRH5           __at(0x1D8D);	// @ (0x3B1 * 8 + 5)
#define                                 TU16BPRH5_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPRH6>
extern volatile __bit                   TU16BPRH6           __at(0x1D8E);	// @ (0x3B1 * 8 + 6)
#define                                 TU16BPRH6_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPRH7>
extern volatile __bit                   TU16BPRH7           __at(0x1D8F);	// @ (0x3B1 * 8 + 7)
#define                                 TU16BPRH7_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BCON0<TU16BPRIE>
extern volatile __bit                   TU16BPRIE           __at(0x1D52);	// @ (0x3AA * 8 + 2)
#define                                 TU16BPRIE_bit       _BIT_ACCESS(TU16BCON0,2)
// TU16BCON1<TU16BPRIF>
extern volatile __bit                   TU16BPRIF           __at(0x1D5A);	// @ (0x3AB * 8 + 2)
#define                                 TU16BPRIF_bit       _BIT_ACCESS(TU16BCON1,2)
// TU16BPRL<TU16BPRL0>
extern volatile __bit                   TU16BPRL0           __at(0x1D80);	// @ (0x3B0 * 8 + 0)
#define                                 TU16BPRL0_bit       _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPRL1>
extern volatile __bit                   TU16BPRL1           __at(0x1D81);	// @ (0x3B0 * 8 + 1)
#define                                 TU16BPRL1_bit       _BIT_ACCESS(TU16BPRL,1)
// TU16BPRL<TU16BPRL2>
extern volatile __bit                   TU16BPRL2           __at(0x1D82);	// @ (0x3B0 * 8 + 2)
#define                                 TU16BPRL2_bit       _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPRL3>
extern volatile __bit                   TU16BPRL3           __at(0x1D83);	// @ (0x3B0 * 8 + 3)
#define                                 TU16BPRL3_bit       _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPRL4>
extern volatile __bit                   TU16BPRL4           __at(0x1D84);	// @ (0x3B0 * 8 + 4)
#define                                 TU16BPRL4_bit       _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPRL5>
extern volatile __bit                   TU16BPRL5           __at(0x1D85);	// @ (0x3B0 * 8 + 5)
#define                                 TU16BPRL5_bit       _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPRL6>
extern volatile __bit                   TU16BPRL6           __at(0x1D86);	// @ (0x3B0 * 8 + 6)
#define                                 TU16BPRL6_bit       _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPRL7>
extern volatile __bit                   TU16BPRL7           __at(0x1D87);	// @ (0x3B0 * 8 + 7)
#define                                 TU16BPRL7_bit       _BIT_ACCESS(TU16BPRL,7)
// TU16BPS<TU16BPS0>
extern volatile __bit                   TU16BPS0            __at(0x1D68);	// @ (0x3AD * 8 + 0)
#define                                 TU16BPS0_bit        _BIT_ACCESS(TU16BPS,0)
// TU16BPS<TU16BPS1>
extern volatile __bit                   TU16BPS1            __at(0x1D69);	// @ (0x3AD * 8 + 1)
#define                                 TU16BPS1_bit        _BIT_ACCESS(TU16BPS,1)
// TU16BPS<TU16BPS2>
extern volatile __bit                   TU16BPS2            __at(0x1D6A);	// @ (0x3AD * 8 + 2)
#define                                 TU16BPS2_bit        _BIT_ACCESS(TU16BPS,2)
// TU16BPS<TU16BPS3>
extern volatile __bit                   TU16BPS3            __at(0x1D6B);	// @ (0x3AD * 8 + 3)
#define                                 TU16BPS3_bit        _BIT_ACCESS(TU16BPS,3)
// TU16BPS<TU16BPS4>
extern volatile __bit                   TU16BPS4            __at(0x1D6C);	// @ (0x3AD * 8 + 4)
#define                                 TU16BPS4_bit        _BIT_ACCESS(TU16BPS,4)
// TU16BPS<TU16BPS5>
extern volatile __bit                   TU16BPS5            __at(0x1D6D);	// @ (0x3AD * 8 + 5)
#define                                 TU16BPS5_bit        _BIT_ACCESS(TU16BPS,5)
// TU16BPS<TU16BPS6>
extern volatile __bit                   TU16BPS6            __at(0x1D6E);	// @ (0x3AD * 8 + 6)
#define                                 TU16BPS6_bit        _BIT_ACCESS(TU16BPS,6)
// TU16BPS<TU16BPS7>
extern volatile __bit                   TU16BPS7            __at(0x1D6F);	// @ (0x3AD * 8 + 7)
#define                                 TU16BPS7_bit        _BIT_ACCESS(TU16BPS,7)
// TU16BCON0<TU16BRDSEL>
extern volatile __bit                   TU16BRDSEL          __at(0x1D53);	// @ (0x3AA * 8 + 3)
#define                                 TU16BRDSEL_bit      _BIT_ACCESS(TU16BCON0,3)
// TU16BHLT<TU16BRESET0>
extern volatile __bit                   TU16BRESET0         __at(0x1D62);	// @ (0x3AC * 8 + 2)
#define                                 TU16BRESET0_bit     _BIT_ACCESS(TU16BHLT,2)
// TU16BHLT<TU16BRESET1>
extern volatile __bit                   TU16BRESET1         __at(0x1D63);	// @ (0x3AC * 8 + 3)
#define                                 TU16BRESET1_bit     _BIT_ACCESS(TU16BHLT,3)
// TU16BCON1<TU16BRUN>
extern volatile __bit                   TU16BRUN            __at(0x1D5F);	// @ (0x3AB * 8 + 7)
#define                                 TU16BRUN_bit        _BIT_ACCESS(TU16BCON1,7)
// TU16BHLT<TU16BSTART0>
extern volatile __bit                   TU16BSTART0         __at(0x1D64);	// @ (0x3AC * 8 + 4)
#define                                 TU16BSTART0_bit     _BIT_ACCESS(TU16BHLT,4)
// TU16BHLT<TU16BSTART1>
extern volatile __bit                   TU16BSTART1         __at(0x1D65);	// @ (0x3AC * 8 + 5)
#define                                 TU16BSTART1_bit     _BIT_ACCESS(TU16BHLT,5)
// TU16BHLT<TU16BSTOP0>
extern volatile __bit                   TU16BSTOP0          __at(0x1D60);	// @ (0x3AC * 8 + 0)
#define                                 TU16BSTOP0_bit      _BIT_ACCESS(TU16BHLT,0)
// TU16BHLT<TU16BSTOP1>
extern volatile __bit                   TU16BSTOP1          __at(0x1D61);	// @ (0x3AC * 8 + 1)
#define                                 TU16BSTOP1_bit      _BIT_ACCESS(TU16BHLT,1)
// TU16BTMRL<TU16BTMR0>
extern volatile __bit                   TU16BTMR0           __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BTMR0_bit       _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMR1>
extern volatile __bit                   TU16BTMR1           __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BTMR1_bit       _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRH<TU16BTMR10>
extern volatile __bit                   TU16BTMR10          __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMR10_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMR11>
extern volatile __bit                   TU16BTMR11          __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMR11_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMR12>
extern volatile __bit                   TU16BTMR12          __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMR12_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMR13>
extern volatile __bit                   TU16BTMR13          __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BTMR13_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMR14>
extern volatile __bit                   TU16BTMR14          __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BTMR14_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMR15>
extern volatile __bit                   TU16BTMR15          __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BTMR15_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMR2>
extern volatile __bit                   TU16BTMR2           __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BTMR2_bit       _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMR3>
extern volatile __bit                   TU16BTMR3           __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BTMR3_bit       _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMR4>
extern volatile __bit                   TU16BTMR4           __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BTMR4_bit       _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMR5>
extern volatile __bit                   TU16BTMR5           __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BTMR5_bit       _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMR6>
extern volatile __bit                   TU16BTMR6           __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BTMR6_bit       _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMR7>
extern volatile __bit                   TU16BTMR7           __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BTMR7_bit       _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRH<TU16BTMR8>
extern volatile __bit                   TU16BTMR8           __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMR8_bit       _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMR9>
extern volatile __bit                   TU16BTMR9           __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMR9_bit       _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH0>
extern volatile __bit                   TU16BTMRH0          __at(0x1D78);	// @ (0x3AF * 8 + 0)
#define                                 TU16BTMRH0_bit      _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMRH1>
extern volatile __bit                   TU16BTMRH1          __at(0x1D79);	// @ (0x3AF * 8 + 1)
#define                                 TU16BTMRH1_bit      _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH2>
extern volatile __bit                   TU16BTMRH2          __at(0x1D7A);	// @ (0x3AF * 8 + 2)
#define                                 TU16BTMRH2_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMRH3>
extern volatile __bit                   TU16BTMRH3          __at(0x1D7B);	// @ (0x3AF * 8 + 3)
#define                                 TU16BTMRH3_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMRH4>
extern volatile __bit                   TU16BTMRH4          __at(0x1D7C);	// @ (0x3AF * 8 + 4)
#define                                 TU16BTMRH4_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMRH5>
extern volatile __bit                   TU16BTMRH5          __at(0x1D7D);	// @ (0x3AF * 8 + 5)
#define                                 TU16BTMRH5_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMRH6>
extern volatile __bit                   TU16BTMRH6          __at(0x1D7E);	// @ (0x3AF * 8 + 6)
#define                                 TU16BTMRH6_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMRH7>
extern volatile __bit                   TU16BTMRH7          __at(0x1D7F);	// @ (0x3AF * 8 + 7)
#define                                 TU16BTMRH7_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMRL0>
extern volatile __bit                   TU16BTMRL0          __at(0x1D70);	// @ (0x3AE * 8 + 0)
#define                                 TU16BTMRL0_bit      _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMRL1>
extern volatile __bit                   TU16BTMRL1          __at(0x1D71);	// @ (0x3AE * 8 + 1)
#define                                 TU16BTMRL1_bit      _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRL<TU16BTMRL2>
extern volatile __bit                   TU16BTMRL2          __at(0x1D72);	// @ (0x3AE * 8 + 2)
#define                                 TU16BTMRL2_bit      _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMRL3>
extern volatile __bit                   TU16BTMRL3          __at(0x1D73);	// @ (0x3AE * 8 + 3)
#define                                 TU16BTMRL3_bit      _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMRL4>
extern volatile __bit                   TU16BTMRL4          __at(0x1D74);	// @ (0x3AE * 8 + 4)
#define                                 TU16BTMRL4_bit      _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMRL5>
extern volatile __bit                   TU16BTMRL5          __at(0x1D75);	// @ (0x3AE * 8 + 5)
#define                                 TU16BTMRL5_bit      _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMRL6>
extern volatile __bit                   TU16BTMRL6          __at(0x1D76);	// @ (0x3AE * 8 + 6)
#define                                 TU16BTMRL6_bit      _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMRL7>
extern volatile __bit                   TU16BTMRL7          __at(0x1D77);	// @ (0x3AE * 8 + 7)
#define                                 TU16BTMRL7_bit      _BIT_ACCESS(TU16BTMRL,7)
// TU16BCON0<TU16BZIE>
extern volatile __bit                   TU16BZIE            __at(0x1D51);	// @ (0x3AA * 8 + 1)
#define                                 TU16BZIE_bit        _BIT_ACCESS(TU16BCON0,1)
// TU16BCON1<TU16BZIF>
extern volatile __bit                   TU16BZIF            __at(0x1D59);	// @ (0x3AB * 8 + 1)
#define                                 TU16BZIF_bit        _BIT_ACCESS(TU16BCON1,1)
// PMD6<TU1MD>
extern volatile __bit                   TU1MD               __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 TU1MD_bit           _BIT_ACCESS(PMD6,0)
// PMD6<TU2MD>
extern volatile __bit                   TU2MD               __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 TU2MD_bit           _BIT_ACCESS(PMD6,1)
// TUIN0PPS<TUIN0PPS0>
extern volatile __bit                   TUIN0PPS0           __at(0x13C0);	// @ (0x278 * 8 + 0)
#define                                 TUIN0PPS0_bit       _BIT_ACCESS(TUIN0PPS,0)
// TUIN0PPS<TUIN0PPS1>
extern volatile __bit                   TUIN0PPS1           __at(0x13C1);	// @ (0x278 * 8 + 1)
#define                                 TUIN0PPS1_bit       _BIT_ACCESS(TUIN0PPS,1)
// TUIN0PPS<TUIN0PPS2>
extern volatile __bit                   TUIN0PPS2           __at(0x13C2);	// @ (0x278 * 8 + 2)
#define                                 TUIN0PPS2_bit       _BIT_ACCESS(TUIN0PPS,2)
// TUIN0PPS<TUIN0PPS3>
extern volatile __bit                   TUIN0PPS3           __at(0x13C3);	// @ (0x278 * 8 + 3)
#define                                 TUIN0PPS3_bit       _BIT_ACCESS(TUIN0PPS,3)
// TUIN0PPS<TUIN0PPS4>
extern volatile __bit                   TUIN0PPS4           __at(0x13C4);	// @ (0x278 * 8 + 4)
#define                                 TUIN0PPS4_bit       _BIT_ACCESS(TUIN0PPS,4)
// TUIN0PPS<TUIN0PPS5>
extern volatile __bit                   TUIN0PPS5           __at(0x13C5);	// @ (0x278 * 8 + 5)
#define                                 TUIN0PPS5_bit       _BIT_ACCESS(TUIN0PPS,5)
// TUIN1PPS<TUIN1PPS0>
extern volatile __bit                   TUIN1PPS0           __at(0x13C8);	// @ (0x279 * 8 + 0)
#define                                 TUIN1PPS0_bit       _BIT_ACCESS(TUIN1PPS,0)
// TUIN1PPS<TUIN1PPS1>
extern volatile __bit                   TUIN1PPS1           __at(0x13C9);	// @ (0x279 * 8 + 1)
#define                                 TUIN1PPS1_bit       _BIT_ACCESS(TUIN1PPS,1)
// TUIN1PPS<TUIN1PPS2>
extern volatile __bit                   TUIN1PPS2           __at(0x13CA);	// @ (0x279 * 8 + 2)
#define                                 TUIN1PPS2_bit       _BIT_ACCESS(TUIN1PPS,2)
// TUIN1PPS<TUIN1PPS3>
extern volatile __bit                   TUIN1PPS3           __at(0x13CB);	// @ (0x279 * 8 + 3)
#define                                 TUIN1PPS3_bit       _BIT_ACCESS(TUIN1PPS,3)
// TUIN1PPS<TUIN1PPS4>
extern volatile __bit                   TUIN1PPS4           __at(0x13CC);	// @ (0x279 * 8 + 4)
#define                                 TUIN1PPS4_bit       _BIT_ACCESS(TUIN1PPS,4)
// TUIN1PPS<TUIN1PPS5>
extern volatile __bit                   TUIN1PPS5           __at(0x13CD);	// @ (0x279 * 8 + 5)
#define                                 TUIN1PPS5_bit       _BIT_ACCESS(TUIN1PPS,5)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x580);	// @ (0xB0 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x581);	// @ (0xB0 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x582);	// @ (0xB0 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x583);	// @ (0xB0 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x584);	// @ (0xB0 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x585);	// @ (0xB0 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// SPI1TWIDTH<TWIDTH0>
extern volatile __bit                   TWIDTH0             __at(0x440);	// @ (0x88 * 8 + 0)
#define                                 TWIDTH0_bit         _BIT_ACCESS(SPI1TWIDTH,0)
// SPI1TWIDTH<TWIDTH1>
extern volatile __bit                   TWIDTH1             __at(0x441);	// @ (0x88 * 8 + 1)
#define                                 TWIDTH1_bit         _BIT_ACCESS(SPI1TWIDTH,1)
// SPI1TWIDTH<TWIDTH2>
extern volatile __bit                   TWIDTH2             __at(0x442);	// @ (0x88 * 8 + 2)
#define                                 TWIDTH2_bit         _BIT_ACCESS(SPI1TWIDTH,2)
// SPI1TXB<TXB0>
extern volatile __bit                   TXB0                __at(0x408);	// @ (0x81 * 8 + 0)
#define                                 TXB0_bit            _BIT_ACCESS(SPI1TXB,0)
// SPI1TXB<TXB1>
extern volatile __bit                   TXB1                __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 TXB1_bit            _BIT_ACCESS(SPI1TXB,1)
// SPI1TXB<TXB2>
extern volatile __bit                   TXB2                __at(0x40A);	// @ (0x81 * 8 + 2)
#define                                 TXB2_bit            _BIT_ACCESS(SPI1TXB,2)
// SPI1TXB<TXB3>
extern volatile __bit                   TXB3                __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 TXB3_bit            _BIT_ACCESS(SPI1TXB,3)
// SPI1TXB<TXB4>
extern volatile __bit                   TXB4                __at(0x40C);	// @ (0x81 * 8 + 4)
#define                                 TXB4_bit            _BIT_ACCESS(SPI1TXB,4)
// SPI1TXB<TXB5>
extern volatile __bit                   TXB5                __at(0x40D);	// @ (0x81 * 8 + 5)
#define                                 TXB5_bit            _BIT_ACCESS(SPI1TXB,5)
// SPI1TXB<TXB6>
extern volatile __bit                   TXB6                __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 TXB6_bit            _BIT_ACCESS(SPI1TXB,6)
// SPI1TXB<TXB7>
extern volatile __bit                   TXB7                __at(0x40F);	// @ (0x81 * 8 + 7)
#define                                 TXB7_bit            _BIT_ACCESS(SPI1TXB,7)
// SPI1CON2<TXR>
extern volatile __bit                   TXR                 __at(0x431);	// @ (0x86 * 8 + 1)
#define                                 TXR_bit             _BIT_ACCESS(SPI1CON2,1)
// I2C1CON1<TXU>
extern volatile __bit                   TXU                 __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 TXU_bit             _BIT_ACCESS(I2C1CON1,1)
// SPI1INTE<TXUIE>
extern volatile __bit                   TXUIE               __at(0x459);	// @ (0x8B * 8 + 1)
#define                                 TXUIE_bit           _BIT_ACCESS(SPI1INTE,1)
// SPI1INTF<TXUIF>
extern volatile __bit                   TXUIF               __at(0x451);	// @ (0x8A * 8 + 1)
#define                                 TXUIF_bit           _BIT_ACCESS(SPI1INTF,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0x1556);	// @ (0x2AA * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0x1582);	// @ (0x2B0 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0x1586);	// @ (0x2B0 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0x1595);	// @ (0x2B2 * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0x158D);	// @ (0x2B1 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0x1557);	// @ (0x2AA * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0x1559);	// @ (0x2AB * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0x1563);	// @ (0x2AC * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0x1594);	// @ (0x2B2 * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0x158C);	// @ (0x2B1 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// U1CTSPPS<U1CTSPPS0>
extern volatile __bit                   U1CTSPPS0           __at(0x1398);	// @ (0x273 * 8 + 0)
#define                                 U1CTSPPS0_bit       _BIT_ACCESS(U1CTSPPS,0)
// U1CTSPPS<U1CTSPPS1>
extern volatile __bit                   U1CTSPPS1           __at(0x1399);	// @ (0x273 * 8 + 1)
#define                                 U1CTSPPS1_bit       _BIT_ACCESS(U1CTSPPS,1)
// U1CTSPPS<U1CTSPPS2>
extern volatile __bit                   U1CTSPPS2           __at(0x139A);	// @ (0x273 * 8 + 2)
#define                                 U1CTSPPS2_bit       _BIT_ACCESS(U1CTSPPS,2)
// U1CTSPPS<U1CTSPPS3>
